// Самовызываемая анонимная функция делает недоступной переменную с данными за ее пределами
// Данные можно будет получить только через локально хранилище
(function() {
    "use strict";
    var quizData = {
        caption: "Тест по роману М.А.Булгакова *Мастер и Маргарита*",
        questions: [
            {
                question: "Какие варианты названий в первой редакции были у романа *Мастер и Маргарита*?",
                answers: ["Черный маг", "Копыто инженера", "Гастроль", "Давным-давно..."],
                correctAnswers: [true, true, true, false]
            },
            {
                question: "Герой, который один из первых повстречался в Москве с Воландом. Назовите настоящую фамилию Ивана Бездомного?",
                answers: ["Лавров", "Понырев", "Босой", "Берлиоз"],
                correctAnswers: [false, true, false, false]
            },
            {
                question: "Существует версия, что у Сатаны разного цвета глаза. Какого цвета были глаза у Воланда?",
                answers: ["карие", "левый черный, правый красный", "правый черный, левый зеленый", "правый с золотой искрой на дне, левый – пустой и черный", "зеленые"],
                correctAnswers: [false, false, true, true, false]
            },
            {
                question: "В честь какого праздника одному из осужденных, великодушный кесарь возвращал жизнь?",
                answers: ["Масленица", "Рождество", "Пасха", "Троица"],
                correctAnswers: [false, false, true, false]
            },
            {
                question: "Герой Иван Николаевич Бездомный работал в газете. Назовите издание, в котором печатали его стихи?",
                answers: ["Комсомольская Правда", "Литературная Газета", "Известия", "Правда"],
                correctAnswers: [false, true, false, false]
            },
            {
                question: "В романе встречается герой, которого называют Всадник Золотое Копьё. Это прозвище:",
                answers: ["Понтий Пилат", "Марк Крысобой", "Кесаря", "Бегемота"],
                correctAnswers: [true, false, false, false]
            }
        ]
    };

    localStorage.setItem('my-quiz-data', JSON.stringify(quizData));

})();
